DebtManagment/src/Documents/РеестрДолжников/РеестрДолжников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрДолжников</name>
  <registerRecords>InformationRegister.СтатусыРаботыСДолгом</registerRecords>
  <registerRecords>InformationRegister.ДолгиДолжников</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДолгов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Должники</name>
    <attributes>
      <name>Должник</name>
      <type>
        <types>CatalogRef.Должники</types>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДолжника</name>
      <type>
        <types>EnumRef.СтатусыДолжника</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/InformationRegisters/ДолгиДолжников/ДолгиДолжников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолгиДолжников</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусДолжника</name>
    <type>
      <types>EnumRef.СтатусыДолжника</types>
    </type>
  </resources>
  <dimensions>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/AccumulationRegisters/ОстаткиДолгов/ОстаткиДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДолгов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DebtManagment/src/InformationRegisters/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРаботыСДолгом</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Documents/РеестрДолжников/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиДолгов Приход
        СформироватьДвиженияДолгиДолжников() ;
		СформироватьДвиженияОстаткиДолгов() ;
		СформироватьСтатусыРаботыСДолгом();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура СформироватьДвиженияДолгиДолжников() 
		Движения.ДолгиДолжников.Записывать = Истина;
	Для Каждого ТекСтрокаДолжники Из Должники Цикл
		Движение = Движения.ДолгиДолжников.Добавить();
		Движение.Должник = ТекСтрокаДолжники.Должник;
		Движение.Долг = ТекСтрокаДолжники.Долг;
		Движение.СтатусДолжника = ТекСтрокаДолжники.СтатусДолжника;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияОстаткиДолгов() 
	
	     ТЗДолги=Должники.Выгрузить();
		 ТЗДолги.Свернуть("Долг,СуммаЗадолженности");
	Движения.ОстаткиДолгов.Записывать = Истина;
	Для Каждого ТекСтрокаДолжники Из ТЗДолги Цикл
		Движение = Движения.ОстаткиДолгов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Долг = ТекСтрокаДолжники.Долг;
		Движение.Сумма = ТекСтрокаДолжники.СуммаЗадолженности;
	КонецЦикла;
КонецПроцедуры	  


Процедура СформироватьСтатусыРаботыСДолгом() 
	Если ЗначениеЗаполнено(СтатусРаботыСДолгом) тогда
		ТЗДолги=Должники.Выгрузить();
		ТЗДолги.Свернуть("Долг");
		Движения.СтатусыРаботыСДолгом.Записывать = Истина;
		Для Каждого ТекСтрокаДолжники Из ТЗДолги Цикл
			Движение = Движения.СтатусыРаботыСДолгом.Добавить(); 
			Движение.Период = Дата;
			Движение.Долг = ТекСтрокаДолжники.Долг;
			Движение.Реестр=Ссылка;
			Движение.СтатусРаботыСДолгом = СтатусРаботыСДолгом;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры
